Bartchez/quad-stm32/Program/_Application/qdt_config.h
/* Includes ------------------------------------------------------------------*/
#include "inttypes.h"
#include <stm32f10x.h>

// define QUAD or PILOT
#define QUAD
//#define PILOT


/***
 * Pin Configuration
 */ 

/*********************** SPI - rfm12 (HW/SW) **************************/	 
// SPI interface	 
#define RFM12_SPI				SPI1
	 
// SPI - CS	 
#define RFM12_PORT_SS			GPIOC
#define RFM12_BIT_SS			GPIO_Pin_1

// SPI - DATA
#define RFM12_PORT_SPI			GPIOA
#define RFM12_BIT_SCK			GPIO_Pin_5
#define RFM12_BIT_MISO			GPIO_Pin_6
#define RFM12_BIT_MOSI			GPIO_Pin_7  

// SPI - INT 
#define RFM12_PORT_INT			GPIOC
#define RFM12_BIT_INT			GPIO_Pin_0 
 

/*********************** LEDs (SW) *************************/	 
// LEDs port 
#define LEDS_PORT				GPIOB 
 
// LEDs pins 
#define LED_BIT_1				GPIO_Pin_15 
#define LED_BIT_2				GPIO_Pin_14 
#define LED_BIT_3				GPIO_Pin_13 
#define LED_BIT_4				GPIO_Pin_12 
 
 
/*********************** USART - COM (HW) *************************/	 
// GPS - USART interface 
#define COM_USART				USART1 
 
// GPS - USART port 
#define COM_PORT				GPIOA 
 
// GPS - USART pins 
#define COM_BIT_TX				GPIO_Pin_9 
#define COM_BIT_RX				GPIO_Pin_10 
 
 
/*********************** PWM - LCD (HW) *************************/	 
//#ifdef PILOT 
	// PWM port 
	#define PWM_PORT				GPIOB 
 
	// PWM pins 
	#define PWM_BIT_1				GPIO_Pin_8 
//#endif 

 
/*********************** PRESSURE (HW) *************************/	  
// SPI interface	 
#define PRESSURE_I2C		I2C2

 
// PRESSURE - I2C port 
#define PRESSURE_PORT		GPIOB 
 
// PRESSURE - I2C pins 
#define PRESSURE_BIT_1		GPIO_Pin_10 
#define PRESSURE_BIT_2		GPIO_Pin_11 

 
/*********************** USART - GPS (HW) *************************/	 
//#ifdef QUAD 
	// GPS - USART interface 
	#define GPS_USART				USART2 
 
	// GPS - USART port 
	#define GPS_PORT				GPIOA 
 
	// GPS - USART pins 
	#define GPS_BIT_TX				GPIO_Pin_2 
	#define GPS_BIT_RX				GPIO_Pin_3 
//#endif 
 
 
/*********************** TEMPERATURE (SW) *************************/	  
//#ifdef QUAD 

	// GPS - USART port 
	#define TEMPERATURE_PORT		GPIOC 
 
	// GPS - USART pins 
	#define TEMPERATURE_BIT_1		GPIO_Pin_3 
	#define TEMPERATURE_BIT_2	 	GPIO_Pin_4 
	#define TEMPERATURE_BIT_3		GPIO_Pin_5 
	#define TEMPERATURE_BIT_4		GPIO_Pin_6 
	#define TEMPERATURE_BIT_5		GPIO_Pin_7 
	#define TEMPERATURE_BIT_6		GPIO_Pin_8 
 
//#endif 
